# 데이터 재구성
## 피봇(pivot)
- 행열을 바꿔서 표를 재구성하는 함수

In [2]:
import pandas as pd
import numpy as np

In [6]:
df = pd.DataFrame({'이름': ['철수','영희','철수','영희'],
                   '과목': ['국어','국어','수학','수학'],
                   '점수': [90,85,80,95]
                    })
df

   이름  과목  점수
0  철수  국어  90
1  영희  국어  85
2  철수  수학  80
3  영희  수학  95

In [9]:
# pivot(인덱스,컬럼, 데이터)
# 원본데이터의 컬럼 중에서 선택
result = df.pivot(index='이름',columns='과목',values='점수')
print(result.index)
print(result.columns)

Index(['영희', '철수'], dtype='object', name='이름')
Index(['국어', '수학'], dtype='object', name='과목')

In [10]:
df = pd.DataFrame({'카테고리':['식품','식품','가전','가전'],
                   '월': ['1월','2월','1월','2월'],
                   '매출': [200,250,500,550]
                  })
df

  카테고리   월   매출
0   식품  1월  200
1   식품  2월  250
2   가전  1월  500
3   가전  2월  550

In [11]:
result = df.pivot(index='카테고리', columns='월', values='매출')
result

월      1월   2월
카테고리
가전    500  550
식품    200  250

In [12]:
df = pd.DataFrame({'도서관':['중앙','중앙','시립','시립'],
                   '장르':['소설','과학','소설','과학'],
                   '대출건수':[120,45,95,60]
                  })
df

  도서관  장르  대출건수
0  중앙  소설   120
1  중앙  과학    45
2  시립  소설    95
3  시립  과학    60

In [13]:
result = df.pivot(index='도서관',columns='장르',values='대출건수')
result

장르   과학   소설
도서관
시립   60   95
중앙   45  120

In [14]:
df = pd.DataFrame({'지점': ['서울','서울','부산','부산'],
                   '객실유형':['싱글룸','더블룸','싱글룸','더블룸'],
                   '예약건수': [45,30,50,35]
                  })
df

   지점 객실유형  예약건수
0  서울  싱글룸    45
1  서울  더블룸    30
2  부산  싱글룸    50
3  부산  더블룸    35

In [17]:
result =df.pivot(index='지점',columns='객실유형',values='예약건수')
result

객실유형  더블룸  싱글룸
지점
부산     35   50
서울     30   45